In [4]:
import sqlite3

conn = sqlite3.connect('exercicios_bd.db')
cursor = conn.cursor()

# 1. Criação da tabela "alunos"
cursor.execute('''
CREATE TABLE IF NOT EXISTS alunos (
    id INTEGER PRIMARY KEY,
    nome TEXT,
    idade INTEGER,
    curso TEXT
)
''')

In [5]:
# 2. Inserção de registros na tabela "alunos"
cursor.executemany('''
INSERT INTO alunos (nome, idade, curso) VALUES (?, ?, ?)
''', [
    ('Ana Silva', 22, 'Engenharia'),
    ('Carlos Sousa', 19, 'Medicina'),
    ('Maria Oliveira', 25, 'Direito'),
    ('Pedro Martins', 20, 'Engenharia'),
    ('Lucia Pereira', 21, 'Arquitetura')
])

In [6]:
# 3. Consultas Básicas

# a) Selecionar todos os registros da tabela "alunos"
cursor.execute('SELECT * FROM alunos')
alunos = cursor.fetchall()
print("a) Todos os registros:", alunos)

# b) Selecionar o nome e a idade dos alunos com mais de 20 anos
cursor.execute('SELECT nome, idade FROM alunos WHERE idade > 20')
alunos_maior_20 = cursor.fetchall()
print("b) Nome e idade dos alunos com mais de 20 anos:", alunos_maior_20)

# c) Selecionar os alunos do curso de "Engenharia" em ordem alfabética
cursor.execute('SELECT * FROM alunos WHERE curso = "Engenharia" ORDER BY nome ASC')
alunos_engenharia = cursor.fetchall()
print("c) Alunos de Engenharia em ordem alfabética:", alunos_engenharia)

# d) Contar o número total de alunos na tabela
cursor.execute('SELECT COUNT(*) FROM alunos')
total_alunos = cursor.fetchone()[0]
print("d) Número total de alunos:", total_alunos)

a) Todos os registros: [(1, 'Ana Silva', 23, 'Engenharia'), (2, 'Carlos Sousa', 19, 'Medicina'), (4, 'Pedro Martins', 20, 'Engenharia'), (5, 'Lucia Pereira', 21, 'Arquitetura'), (6, 'Ana Silva', 22, 'Engenharia'), (7, 'Carlos Sousa', 19, 'Medicina'), (8, 'Maria Oliveira', 25, 'Direito'), (9, 'Pedro Martins', 20, 'Engenharia'), (10, 'Lucia Pereira', 21, 'Arquitetura')]
b) Nome e idade dos alunos com mais de 20 anos: [('Ana Silva', 23), ('Lucia Pereira', 21), ('Ana Silva', 22), ('Maria Oliveira', 25), ('Lucia Pereira', 21)]
c) Alunos de Engenharia em ordem alfabética: [(1, 'Ana Silva', 23, 'Engenharia'), (6, 'Ana Silva', 22, 'Engenharia'), (4, 'Pedro Martins', 20, 'Engenharia'), (9, 'Pedro Martins', 20, 'Engenharia')]
d) Número total de alunos: 9

In [7]:
# 4. Atualização e Remoção

# a) Atualize a idade de um aluno específico na tabela
cursor.execute('UPDATE alunos SET idade = 23 WHERE nome = "Ana Silva"')

# b) Remova um aluno pelo seu ID
cursor.execute('DELETE FROM alunos WHERE id = 3')

In [8]:
# 5. Criar uma Tabela e Inserir Dados

# Criação da tabela "clientes"
cursor.execute('''
CREATE TABLE IF NOT EXISTS clientes (
    id INTEGER PRIMARY KEY,
    nome TEXT,
    idade INTEGER,
    saldo REAL
)
''')

# Inserção de registros na tabela "clientes"
cursor.executemany('''
INSERT INTO clientes (nome, idade, saldo) VALUES (?, ?, ?)
''', [
    ('João Paulo', 35, 1500.00),
    ('Mariana Costa', 28, 800.00),
    ('Rafael Lima', 42, 1200.00),
    ('Beatriz Alves', 30, 950.00),
    ('Carlos Menezes', 38, 2000.00)
])

In [9]:
# 6. Consultas e Funções Agregadas

# a) Selecione o nome e a idade dos clientes com idade superior a 30 anos
cursor.execute('SELECT nome, idade FROM clientes WHERE idade > 30')
clientes_mais_30 = cursor.fetchall()
print("6a) Clientes com mais de 30 anos:", clientes_mais_30)

# b) Calcule o saldo médio dos clientes
cursor.execute('SELECT AVG(saldo) FROM clientes')
saldo_medio = cursor.fetchone()[0]
print("6b) Saldo médio dos clientes:", saldo_medio)

# c) Encontre o cliente com o saldo máximo
cursor.execute('SELECT nome, saldo FROM clientes ORDER BY saldo DESC LIMIT 1')
cliente_max_saldo = cursor.fetchone()
print("6c) Cliente com o saldo máximo:", cliente_max_saldo)

# d) Conte quantos clientes têm saldo acima de 1000
cursor.execute('SELECT COUNT(*) FROM clientes WHERE saldo > 1000')
clientes_saldo_1000 = cursor.fetchone()[0]
print("6d) Número de clientes com saldo acima de 1000:", clientes_saldo_1000)

6a) Clientes com mais de 30 anos: [('João Paulo', 35), ('Carlos Menezes', 38), ('João Paulo', 35), ('Rafael Lima', 42), ('Carlos Menezes', 38)]
6b) Saldo médio dos clientes: 1411.111111111111
6c) Cliente com o saldo máximo: ('Carlos Menezes', 2000.0)
6d) Número de clientes com saldo acima de 1000: 6

In [10]:
# 7. Atualização e Remoção com Condições

# a) Atualize o saldo de um cliente específico
cursor.execute('UPDATE clientes SET saldo = 1800.00 WHERE nome = "Mariana Costa"')

# b) Remova um cliente pelo seu ID
cursor.execute('DELETE FROM clientes WHERE id = 3')

In [11]:
# 8. Junção de Tabelas

# Criação da tabela "compras"
cursor.execute('''
CREATE TABLE IF NOT EXISTS compras (
    id INTEGER PRIMARY KEY,
    cliente_id INTEGER,
    produto TEXT,
    valor REAL,
    FOREIGN KEY (cliente_id) REFERENCES clientes(id)
)
''')

# Inserção de registros na tabela "compras"
cursor.executemany('''
INSERT INTO compras (cliente_id, produto, valor) VALUES (?, ?, ?)
''', [
    (1, 'Notebook', 2500.00),
    (2, 'Smartphone', 1500.00),
    (4, 'Tablet', 1200.00),
    (5, 'Smart TV', 3000.00)
])

# Consulta para exibir o nome do cliente, o produto e o valor de cada compra
cursor.execute('''
SELECT clientes.nome, compras.produto, compras.valor
FROM compras
JOIN clientes ON compras.cliente_id = clientes.id
''')
compras_info = cursor.fetchall()
print("8) Nome do cliente, produto e valor de cada compra:", compras_info)

# Salvando as alterações e fechando a conexão
conn.commit()
conn.close()

8) Nome do cliente, produto e valor de cada compra: [('João Paulo', 'Notebook', 2500.0), ('Mariana Costa', 'Smartphone', 1500.0), ('Beatriz Alves', 'Tablet', 1200.0), ('Carlos Menezes', 'Smart TV', 3000.0), ('João Paulo', 'Notebook', 2500.0), ('Mariana Costa', 'Smartphone', 1500.0), ('Beatriz Alves', 'Tablet', 1200.0), ('Carlos Menezes', 'Smart TV', 3000.0)]